Revit 2027 API
InsulationLiningBase.GetInsulationIds Method
 Returns the ids of the insulation elements associated to a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetInsulationIds(
	Document document,
	ElementId elemId
)
Public Shared Function GetInsulationIds (
	document As Document,
	elemId As ElementId
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetInsulationIds(
	Document^ document,
	ElementId^ elemId
)
static member GetInsulationIds :
        document : Document *
        elemId : ElementId -> ICollection<ElementId>
Parameters
document Document
 The document.
elemId ElementId
 The element.
Return Value
ICollection<ElementId>
 A collection of the ids of the insulation elements.
Exceptions
Exception | Condition
ArgumentException |  This id does not represent a valid host for insulation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InsulationLiningBase Class
Autodesk.Revit.DB Namespace